Applying **Development**:

```diff
data.http.my_public_ip: Reading...
module.complete.data.http.my_public_ip: Reading...
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=515ce96f34f9c7a45fdec2cb74b073075a85e824]
random_id.this: Refreshing state... [id=Pw]
module.complete.random_id.this: Refreshing state... [id=9w]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete3f]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt]
module.complete.data.aws_availability_zones.available: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
data.aws_availability_zones.available: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Reading...
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt]
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.data.aws_caller_identity.current: Reading...
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Read complete after 0s [id=2902369118]
data.aws_region.current: Reading...
module.complete.data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-f7]
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0db6232b295737a14]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 0s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 0s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 1s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 1s [id=ami-07186848dc5aa7580]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 1s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 1s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 1s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 1s [id=ami-03cbb6f8e3173ca7a]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt|2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 1s [id=ami-065fabeba927f04d3]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 0s [id=ami-0b68236d144f48351]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=2465972644]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 1s [id=ami-0442ca42ae7162b75]
module.complete.data.template_file.user_data: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 0s [id=ami-059bf44c0f5e904d9]
module.complete.data.template_file.user_data: Read complete after 0s [id=9d94336d1d5f21c267e5f5377b0337786596db32709552f5082f4481e4ea58f6]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv|67E3D23B-5EB3-459A-AFEA-68D46952CB43]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=2051964274]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt|69721694-D503-40E8-A738-8158C2BBCC75]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 0s [id=ami-0fb2a8cf2684fdb0c]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-f7-447552758530]
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 0s [id=ami-0434af33056d1e189]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0c83516c3117401be]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0405b5473a0a97771]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0804d4c6665d3ea52]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09a7fe172ce55073e]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-01c62786f091a7c58]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0fafda5febfc17189]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0f51f5664c91fe53e]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-02a3a14ada345bdfa]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0804d4c6665d3ea521080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0682ab1fc14b89c69]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-07ac472f886fd21a4]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-050201b64ab436118]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-f7]
module.complete.aws_lambda_function.this: Refreshing state... [id=XG-Initial-Config-SOPHOS_CNF-f7]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0fa73f03d88d76a91]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0f51f5664c91fe53e1080289494]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-05fa3e241aa846ac2]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-0c2fdbf3d8e50b757]
module.complete.aws_instance.this: Refreshing state... [id=i-0c43ecc2e8630bddc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.complete.aws_eip.this[0] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                        = "eipalloc-05fa3e241aa846ac2"
      ~ tags                      = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.complete.aws_iam_instance_profile.this will be updated in-place
  ~ resource "aws_iam_instance_profile" "this" {
        id          = "ec2-instance-profile-SOPHOS_CNF-f7"
        name        = "ec2-instance-profile-SOPHOS_CNF-f7"
      ~ tags        = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_iam_role.lambda_execution_role will be updated in-place
  ~ resource "aws_iam_role" "lambda_execution_role" {
        id                    = "LambdaExecutionRole-SOPHOS_CNF-f7"
        name                  = "LambdaExecutionRole-SOPHOS_CNF-f7"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
        id                    = "ec2-iam-role-SOPHOS_CNF-f7-447552758530"
        name                  = "ec2-iam-role-SOPHOS_CNF-f7-447552758530"
      ~ tags                  = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all              = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.complete.aws_instance.this will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0c43ecc2e8630bddc"
      ~ source_dest_check                    = false -> true
      ~ tags                                 = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                             = {
-           "Name"          = "sophos-xg-terraform"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ user_data                            = "08c43b2ecc13f67fac8bfc64d00a248a00601063" -> "5a1f2c9a77cbe6f2d4ef09dac0ff53c4bebe2f4e"
        # (28 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.complete.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-09a7fe172ce55073e"
      ~ tags     = {
-           "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all = {
-           "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.complete.aws_lambda_function.this is tainted, so must be replaced
-/+ resource "aws_lambda_function" "this" {
      ~ architectures                  = [] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7" -> (known after apply)
      ~ id                             = "XG-Initial-Config-SOPHOS_CNF-f7" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7/invocations" -> (known after apply)
      ~ last_modified                  = "2022-09-30T14:39:15.342+0000" -> (known after apply)
-       layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7:$LATEST/invocations" -> (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
      ~ source_code_hash               = "lN3NThfvLIWT2ZmvwfzeznxJmua0IJpXJCCdXY9Y9z0=" -> (known after apply)
      ~ source_code_size               = 772 -> (known after apply)
-       tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "$LATEST" -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

      ~ vpc_config {
          ~ vpc_id             = "vpc-0db6232b295737a14" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.complete.aws_launch_template.this will be updated in-place
  ~ resource "aws_launch_template" "this" {
        id                      = "lt-0c2fdbf3d8e50b757"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "launch-template-SOPHOS_CNF-f7-447552758530"
      ~ tags                    = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                = {
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (10 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.complete.aws_network_interface.private will be updated in-place
  ~ resource "aws_network_interface" "private" {
        id                        = "eni-0682ab1fc14b89c69"
      ~ tags                      = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "private-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_network_interface.public will be updated in-place
  ~ resource "aws_network_interface" "public" {
        id                        = "eni-050201b64ab436118"
      ~ tags                      = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                  = {
-           "Name"          = "public-eni-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (22 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.complete.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0f51f5664c91fe53e"
      ~ tags             = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0804d4c6665d3ea52"
      ~ tags             = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all         = {
-           "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.lan[0] will be updated in-place
  ~ resource "aws_security_group" "lan" {
        id                     = "sg-0405b5473a0a97771"
        name                   = "Private Subnet"
      ~ tags                   = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "LAN"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.public[0] will be updated in-place
  ~ resource "aws_security_group" "public" {
        id                     = "sg-0c83516c3117401be"
        name                   = "Public"
      ~ tags                   = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Public"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.complete.aws_security_group.trusted[0] will be updated in-place
  ~ resource "aws_security_group" "trusted" {
        id                     = "sg-0fafda5febfc17189"
      ~ ingress                = [
+           {
+               cidr_blocks      = [
+                   "47.184.79.94/32",
+                   "13.66.10.164/32",
                ]
+               description      = "Allow all from trusted IP"
+               from_port        = 0
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 65535
            },
-           {
-               cidr_blocks      = [
-                   "47.184.79.94/32",
-                   "20.245.175.52/32",
                ]
-               description      = "Allow all from trusted IP"
-               from_port        = 0
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 65535
            },
        ]
        name                   = "Trusted Network"
      ~ tags                   = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all               = {
-           "Name"          = "Trusted Network"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.complete.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01c62786f091a7c58"
      ~ tags                                           = {
-           "Name"          = "public-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                                       = {
-           "Name"          = "public-SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (14 unchanged attributes hidden)
    }

  # module.complete.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                               = "vpc-0db6232b295737a14"
      ~ tags                             = {
-           "Name"          = "SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
      ~ tags_all                         = {
-           "Name"          = "SOPHOS_CNF-f7-447552758530"
-           "contact_email" = "ralph.brynard@sophos.com"
-           "creation_date" = "09-30-2022"
-           "managed_by"    = "Terraform"
        } -> (known after apply)
        # (15 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

```
module.key-pair.tls_private_key.this[0]: Refreshing state... [id=515ce96f34f9c7a45fdec2cb74b073075a85e824]
module.complete.data.archive_file.lambda_zip: Reading...
module.complete.data.http.my_public_ip: Reading...
random_id.this: Refreshing state... [id=Pw]
data.http.my_public_ip: Reading...
module.complete.random_id.this: Refreshing state... [id=9w]
module.complete.data.archive_file.lambda_zip: Read complete after 0s [id=7517866eb05f876f45c1f92f4725f6c55a51fdd7]
data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.http.my_public_ip: Read complete after 0s [id=https://ifconfig.co/json]
module.complete.data.aws_caller_identity.current: Reading...
data.aws_region.current: Reading...
module.complete.data.aws_ami_ids.sfos: Reading...
module.complete.data.aws_iam_policy_document.trust_relationship: Reading...
module.key-pair.aws_key_pair.this[0]: Refreshing state... [id=sophos-example-complete3f]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Reading...
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt]
module.complete.data.aws_region.current: Reading...
module.complete.data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Reading...
data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.complete.data.aws_iam_policy_document.lambda_execution_trust_policy: Read complete after 0s [id=3693445097]
module.complete.data.aws_iam_policy_document.trust_relationship: Read complete after 0s [id=1903849331]
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Reading...
module.complete.aws_secretsmanager_secret.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv]
module.complete.data.aws_iam_policy_document.lambda_execution_inline_policy: Read complete after 0s [id=2902369118]
module.complete.aws_iam_role.lambda_execution_role: Refreshing state... [id=LambdaExecutionRole-SOPHOS_CNF-f7]
module.complete.aws_secretsmanager_secret.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt]
data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Reading...
data.aws_availability_zone.available["us-west-1b"]: Reading...
module.complete.data.aws_availability_zones.available: Read complete after 0s [id=us-west-1]
data.aws_availability_zone.available["us-west-1c"]: Read complete after 0s [id=us-west-1c]
module.complete.aws_secretsmanager_secret_version.console_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv|67E3D23B-5EB3-459A-AFEA-68D46952CB43]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Reading...
module.complete.data.template_file.user_data: Reading...
module.complete.data.template_file.user_data: Read complete after 0s [id=9d94336d1d5f21c267e5f5377b0337786596db32709552f5082f4481e4ea58f6]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt|69721694-D503-40E8-A738-8158C2BBCC75]
module.complete.data.aws_iam_policy_document.ec2_iam_policy: Read complete after 0s [id=2465972644]
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Reading...
module.complete.data.aws_iam_policy_document.secure_storage_master_key: Read complete after 0s [id=2051964274]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Refreshing state... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt|2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9]
data.aws_availability_zone.available["us-west-1b"]: Read complete after 0s [id=us-west-1b]
module.complete.data.aws_caller_identity.current: Read complete after 0s [id=447552758530]
module.complete.aws_iam_role.this: Refreshing state... [id=ec2-iam-role-SOPHOS_CNF-f7-447552758530]
module.complete.aws_vpc.this[0]: Refreshing state... [id=vpc-0db6232b295737a14]
module.complete.data.aws_ami_ids.sfos: Read complete after 0s [id=1726762986]
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-026c32ba32c93b8c4"]: Read complete after 0s [id=ami-026c32ba32c93b8c4]
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0eafce265f8e28d06"]: Read complete after 0s [id=ami-0eafce265f8e28d06]
module.complete.data.aws_ami.dynamic_ami["ami-030bf19f87a227c8a"]: Read complete after 0s [id=ami-030bf19f87a227c8a]
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0442ca42ae7162b75"]: Read complete after 0s [id=ami-0442ca42ae7162b75]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-091558582143f9648"]: Read complete after 0s [id=ami-091558582143f9648]
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0434af33056d1e189"]: Read complete after 1s [id=ami-0434af33056d1e189]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-059bf44c0f5e904d9"]: Read complete after 1s [id=ami-059bf44c0f5e904d9]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-04b0be28f678af9ee"]: Read complete after 1s [id=ami-04b0be28f678af9ee]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-065fabeba927f04d3"]: Read complete after 1s [id=ami-065fabeba927f04d3]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Reading...
module.complete.data.aws_ami.dynamic_ami["ami-0028214389e81fc39"]: Read complete after 1s [id=ami-0028214389e81fc39]
module.complete.data.aws_ami.dynamic_ami["ami-0b68236d144f48351"]: Read complete after 1s [id=ami-0b68236d144f48351]
module.complete.data.aws_ami.dynamic_ami["ami-053dbe57dfe422765"]: Read complete after 0s [id=ami-053dbe57dfe422765]
module.complete.data.aws_ami.dynamic_ami["ami-03cbb6f8e3173ca7a"]: Read complete after 0s [id=ami-03cbb6f8e3173ca7a]
module.complete.data.aws_ami.dynamic_ami["ami-0fb2a8cf2684fdb0c"]: Read complete after 1s [id=ami-0fb2a8cf2684fdb0c]
module.complete.data.aws_ami.dynamic_ami["ami-0f37b9b5182756d01"]: Read complete after 0s [id=ami-0f37b9b5182756d01]
module.complete.data.aws_ami.dynamic_ami["ami-07186848dc5aa7580"]: Read complete after 0s [id=ami-07186848dc5aa7580]
module.complete.aws_security_group.trusted[0]: Refreshing state... [id=sg-0fafda5febfc17189]
module.complete.aws_route_table.public[0]: Refreshing state... [id=rtb-0804d4c6665d3ea52]
module.complete.aws_subnet.private[0]: Refreshing state... [id=subnet-02a3a14ada345bdfa]
module.complete.aws_security_group.lan[0]: Refreshing state... [id=sg-0405b5473a0a97771]
module.complete.aws_route_table.private[0]: Refreshing state... [id=rtb-0f51f5664c91fe53e]
module.complete.aws_security_group.public[0]: Refreshing state... [id=sg-0c83516c3117401be]
module.complete.aws_internet_gateway.this[0]: Refreshing state... [id=igw-09a7fe172ce55073e]
module.complete.aws_subnet.public[0]: Refreshing state... [id=subnet-01c62786f091a7c58]
module.complete.aws_iam_instance_profile.this: Refreshing state... [id=ec2-instance-profile-SOPHOS_CNF-f7]
module.complete.aws_route_table_association.public: Refreshing state... [id=rtbassoc-07ac472f886fd21a4]
module.complete.aws_network_interface.public: Refreshing state... [id=eni-050201b64ab436118]
module.complete.aws_route.public: Refreshing state... [id=r-rtb-0804d4c6665d3ea521080289494]
module.complete.aws_network_interface.private: Refreshing state... [id=eni-0682ab1fc14b89c69]
module.complete.aws_route_table_association.private: Refreshing state... [id=rtbassoc-0fa73f03d88d76a91]
module.complete.aws_eip.this[0]: Refreshing state... [id=eipalloc-05fa3e241aa846ac2]
module.complete.aws_lambda_function.this: Refreshing state... [id=XG-Initial-Config-SOPHOS_CNF-f7]
module.complete.aws_route.private: Refreshing state... [id=r-rtb-0f51f5664c91fe53e1080289494]
module.complete.aws_launch_template.this: Refreshing state... [id=lt-0c2fdbf3d8e50b757]
module.complete.aws_instance.this: Refreshing state... [id=i-0c43ecc2e8630bddc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "example-completePw==" -> null
      - b64_url     = "example-completePw" -> null
      - byte_length = 1 -> null
      - dec         = "example-complete63" -> null
      - hex         = "example-complete3f" -> null
      - id          = "Pw" -> null
      - prefix      = "example-complete" -> null
    }

  # module.complete.aws_eip.this[0] will be destroyed
  - resource "aws_eip" "this" {
      - allocation_id             = "eipalloc-05fa3e241aa846ac2" -> null
      - associate_with_private_ip = "10.0.0.211" -> null
      - association_id            = "eipassoc-0ae4e3db6f4976f6c" -> null
      - domain                    = "vpc" -> null
      - id                        = "eipalloc-05fa3e241aa846ac2" -> null
      - instance                  = "i-0c43ecc2e8630bddc" -> null
      - network_border_group      = "us-west-1" -> null
      - network_interface         = "eni-050201b64ab436118" -> null
      - private_dns               = "ip-10-0-0-211.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.211" -> null
      - public_dns                = "ec2-54-241-212-222.us-west-1.compute.amazonaws.com" -> null
      - public_ip                 = "54.241.212.222" -> null
      - public_ipv4_pool          = "amazon" -> null
      - tags                      = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc                       = true -> null
    }

  # module.complete.aws_iam_instance_profile.this will be destroyed
  - resource "aws_iam_instance_profile" "this" {
      - arn         = "arn:aws:iam::447552758530:instance-profile/ec2-instance-profile-SOPHOS_CNF-f7" -> null
      - create_date = "2022-09-30T13:42:15Z" -> null
      - id          = "ec2-instance-profile-SOPHOS_CNF-f7" -> null
      - name        = "ec2-instance-profile-SOPHOS_CNF-f7" -> null
      - path        = "/" -> null
      - role        = "ec2-iam-role-SOPHOS_CNF-f7-447552758530" -> null
      - tags        = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id   = "AIPAWQNBZEMBCRF2EM5EL" -> null
    }

  # module.complete.aws_iam_role.lambda_execution_role will be destroyed
  - resource "aws_iam_role" "lambda_execution_role" {
      - arn                   = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-f7" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-30T13:42:29Z" -> null
      - force_detach_policies = false -> null
      - id                    = "LambdaExecutionRole-SOPHOS_CNF-f7" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "LambdaExecutionRole-SOPHOS_CNF-f7" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBGJODIUPUK" -> null

      - inline_policy {
          - name   = "lambda-config-policy-SOPHOS_CNF-f7" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ec2:DescribeNetworkInterfaces",
                              - "ec2:DescribeInstances",
                              - "ec2:DeleteNetworkInterface",
                              - "ec2:CreateNetworkInterface",
                              - "ec2:AttachNetworkInterface",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_iam_role.this will be destroyed
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::447552758530:role/ec2-iam-role-SOPHOS_CNF-f7-447552758530" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-09-30T13:42:15Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ec2-iam-role-SOPHOS_CNF-f7-447552758530" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ec2-iam-role-SOPHOS_CNF-f7-447552758530" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all              = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - unique_id             = "AROAWQNBZEMBCWGUIKVVJ" -> null

      - inline_policy {
          - name   = "ec2-policy-SOPHOS_CNF-f7" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv",
                              - "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt",
                            ]
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "ssm-policy-SOPHOS_CNF-f7" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                              - "secretsmanager:DescribeSecret",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt"
                          - Sid      = ""
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.complete.aws_instance.this will be destroyed
  - resource "aws_instance" "this" {
      - ami                                  = "ami-0f37b9b5182756d01" -> null
      - arn                                  = "arn:aws:ec2:us-west-1:447552758530:instance/i-0c43ecc2e8630bddc" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-west-1b" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 2 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - iam_instance_profile                 = "ec2-instance-profile-SOPHOS_CNF-f7" -> null
      - id                                   = "i-0c43ecc2e8630bddc" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t3.medium" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "sophos-example-complete3f" -> null
      - monitoring                           = true -> null
      - primary_network_interface_id         = "eni-0682ab1fc14b89c69" -> null
      - private_dns                          = "ip-10-0-1-75.us-west-1.compute.internal" -> null
      - private_ip                           = "10.0.1.75" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = false -> null
      - subnet_id                            = "subnet-02a3a14ada345bdfa" -> null
      - tags                                 = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                             = {
          - "Name"          = "sophos-xg-terraform"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "08c43b2ecc13f67fac8bfc64d00a248a00601063" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0405b5473a0a97771",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      - ebs_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvdg" -> null
          - encrypted             = false -> null
          - iops                  = 240 -> null
          - snapshot_id           = "snap-0ac9373189f97066a" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-00d779f7a1a10c6e6" -> null
          - volume_size           = 80 -> null
          - volume_type           = "gp2" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - launch_template {
          - id      = "lt-0c2fdbf3d8e50b757" -> null
          - name    = "launch-template-SOPHOS_CNF-f7-447552758530" -> null
          - version = "$Latest" -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-05049f142a26a4780" -> null
          - volume_size           = 16 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.complete.aws_internet_gateway.this[0] will be destroyed
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-west-1:447552758530:internet-gateway/igw-09a7fe172ce55073e" -> null
      - id       = "igw-09a7fe172ce55073e" -> null
      - owner_id = "447552758530" -> null
      - tags     = {
          - "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all = {
          - "Name"          = "igw-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id   = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_lambda_function.this will be destroyed
  - resource "aws_lambda_function" "this" {
      - architectures                  = [] -> null
      - arn                            = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7" -> null
      - filename                       = "../../initial_config.zip" -> null
      - function_name                  = "XG-Initial-Config-SOPHOS_CNF-f7" -> null
      - handler                        = "config.main" -> null
      - id                             = "XG-Initial-Config-SOPHOS_CNF-f7" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7/invocations" -> null
      - last_modified                  = "2022-09-30T14:39:15.342+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-1:447552758530:function:XG-Initial-Config-SOPHOS_CNF-f7:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::447552758530:role/LambdaExecutionRole-SOPHOS_CNF-f7" -> null
      - runtime                        = "python3.7" -> null
      - source_code_hash               = "lN3NThfvLIWT2ZmvwfzeznxJmua0IJpXJCCdXY9Y9z0=" -> null
      - source_code_size               = 772 -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
      - timeout                        = 3 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "CONSOLE_SECRET_NAME" = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv"
              - "IP"                  = "10.0.1.75"
              - "PASSWORD"            = "admin"
              - "REGION_NAME"         = "us-west-1"
              - "USERNAME"            = "admin"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - security_group_ids = [
              - "sg-0405b5473a0a97771",
            ] -> null
          - subnet_ids         = [
              - "subnet-02a3a14ada345bdfa",
            ] -> null
          - vpc_id             = "vpc-0db6232b295737a14" -> null
        }
    }

  # module.complete.aws_launch_template.this will be destroyed
  - resource "aws_launch_template" "this" {
      - arn                     = "arn:aws:ec2:us-west-1:447552758530:launch-template/lt-0c2fdbf3d8e50b757" -> null
      - default_version         = 1 -> null
      - disable_api_stop        = false -> null
      - disable_api_termination = false -> null
      - id                      = "lt-0c2fdbf3d8e50b757" -> null
      - image_id                = "ami-0f37b9b5182756d01" -> null
      - instance_type           = "t3.medium" -> null
      - key_name                = "sophos-example-complete3f" -> null
      - latest_version          = 1 -> null
      - name                    = "launch-template-SOPHOS_CNF-f7-447552758530" -> null
      - security_group_names    = [] -> null
      - tags                    = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                = {
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - user_data               = "eyJzc21rU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1zZWN1cmUtc3RvcmFnZS1tYXN0ZXIta2V5LVNPUEhPU19DTkYtZjctRU9idXl0IiwiaG9zdG5hbWUiOiJzb3Bob3MteGctdGVycmFmb3JtIiwic2VuZHN0YXRzIjogIm9uIiwicmVnaW9uIjoidXMtd2VzdC0xIiwic2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1jb25zb2xlLXBhc3N3b3JkLVNPUEhPU19DTkYtZjctNU9sTlR2IiwiY29uZmlnU2VjcmV0SWQiOiJhcm46YXdzOnNlY3JldHNtYW5hZ2VyOnVzLXdlc3QtMTo0NDc1NTI3NTg1MzA6c2VjcmV0OnNvcGhvcy1mdy1iYWNrdXAtY29uZmlndXJhdGlvbi1wYXNzd29yZC1TT1BIT1NfQ05GLWY3LUJKNWNHdCJ9" -> null
      - vpc_security_group_ids  = [] -> null

      - block_device_mappings {
          - device_name = "/dev/xvda" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 16 -> null
              - volume_type           = "gp2" -> null
            }
        }
      - block_device_mappings {
          - device_name = "/dev/xvdg" -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "false" -> null
              - iops                  = 0 -> null
              - throughput            = 0 -> null
              - volume_size           = 80 -> null
              - volume_type           = "gp2" -> null
            }
        }

      - iam_instance_profile {
          - name = "ec2-iam-role-SOPHOS_CNF-f7-447552758530" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "enabled" -> null
        }

      - network_interfaces {
          - device_index         = 1 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-050201b64ab436118" -> null
          - security_groups      = [] -> null
        }
      - network_interfaces {
          - device_index         = 0 -> null
          - ipv4_address_count   = 0 -> null
          - ipv4_addresses       = [] -> null
          - ipv4_prefix_count    = 0 -> null
          - ipv4_prefixes        = [] -> null
          - ipv6_address_count   = 0 -> null
          - ipv6_addresses       = [] -> null
          - ipv6_prefix_count    = 0 -> null
          - ipv6_prefixes        = [] -> null
          - network_card_index   = 0 -> null
          - network_interface_id = "eni-0682ab1fc14b89c69" -> null
          - security_groups      = [] -> null
        }
    }

  # module.complete.aws_network_interface.private will be destroyed
  - resource "aws_network_interface" "private" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-0682ab1fc14b89c69" -> null
      - description               = "ENI for Private Subnet" -> null
      - id                        = "eni-0682ab1fc14b89c69" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:b6:52:a6:d8:35" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-1-75.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.1.75" -> null
      - private_ip_list           = [
          - "10.0.1.75",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.1.75",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-0405b5473a0a97771",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-02a3a14ada345bdfa" -> null
      - tags                      = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "private-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-098372828830db48f" -> null
          - device_index  = 0 -> null
          - instance      = "i-0c43ecc2e8630bddc" -> null
        }
    }

  # module.complete.aws_network_interface.public will be destroyed
  - resource "aws_network_interface" "public" {
      - arn                       = "arn:aws:ec2:us-west-1:447552758530:network-interface/eni-050201b64ab436118" -> null
      - description               = "ENI for Public Subnet" -> null
      - id                        = "eni-050201b64ab436118" -> null
      - interface_type            = "interface" -> null
      - ipv4_prefix_count         = 0 -> null
      - ipv4_prefixes             = [] -> null
      - ipv6_address_count        = 0 -> null
      - ipv6_address_list         = [] -> null
      - ipv6_address_list_enabled = false -> null
      - ipv6_addresses            = [] -> null
      - ipv6_prefix_count         = 0 -> null
      - ipv6_prefixes             = [] -> null
      - mac_address               = "06:8e:0f:39:64:5f" -> null
      - owner_id                  = "447552758530" -> null
      - private_dns_name          = "ip-10-0-0-211.us-west-1.compute.internal" -> null
      - private_ip                = "10.0.0.211" -> null
      - private_ip_list           = [
          - "10.0.0.211",
        ] -> null
      - private_ip_list_enabled   = false -> null
      - private_ips               = [
          - "10.0.0.211",
        ] -> null
      - private_ips_count         = 0 -> null
      - security_groups           = [
          - "sg-0c83516c3117401be",
          - "sg-0fafda5febfc17189",
        ] -> null
      - source_dest_check         = false -> null
      - subnet_id                 = "subnet-01c62786f091a7c58" -> null
      - tags                      = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                  = {
          - "Name"          = "public-eni-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null

      - attachment {
          - attachment_id = "eni-attach-06a51c68c04dbdbbe" -> null
          - device_index  = 1 -> null
          - instance      = "i-0c43ecc2e8630bddc" -> null
        }
    }

  # module.complete.aws_route.private will be destroyed
  - resource "aws_route" "private" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0f51f5664c91fe53e1080289494" -> null
      - instance_id            = "i-0c43ecc2e8630bddc" -> null
      - instance_owner_id      = "447552758530" -> null
      - network_interface_id   = "eni-0682ab1fc14b89c69" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0f51f5664c91fe53e" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route.public will be destroyed
  - resource "aws_route" "public" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-09a7fe172ce55073e" -> null
      - id                     = "r-rtb-0804d4c6665d3ea521080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0804d4c6665d3ea52" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.complete.aws_route_table.private[0] will be destroyed
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-0f51f5664c91fe53e" -> null
      - id               = "rtb-0f51f5664c91fe53e" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = "i-0c43ecc2e8630bddc"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = "eni-0682ab1fc14b89c69"
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "priv-rtb-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_route_table.public[0] will be destroyed
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-west-1:447552758530:route-table/rtb-0804d4c6665d3ea52" -> null
      - id               = "rtb-0804d4c6665d3ea52" -> null
      - owner_id         = "447552758530" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-09a7fe172ce55073e"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all         = {
          - "Name"          = "pub-rtb-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id           = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_route_table_association.private will be destroyed
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0fa73f03d88d76a91" -> null
      - route_table_id = "rtb-0f51f5664c91fe53e" -> null
      - subnet_id      = "subnet-02a3a14ada345bdfa" -> null
    }

  # module.complete.aws_route_table_association.public will be destroyed
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-07ac472f886fd21a4" -> null
      - route_table_id = "rtb-0804d4c6665d3ea52" -> null
      - subnet_id      = "subnet-01c62786f091a7c58" -> null
    }

  # module.complete.aws_secretsmanager_secret.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret" "config_backup_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt" -> null
      - name                           = "sophos-fw-backup-configuration-password-SOPHOS_CNF-f7" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.console_password will be destroyed
  - resource "aws_secretsmanager_secret" "console_password" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv" -> null
      - name                           = "sophos-fw-console-password-SOPHOS_CNF-f7" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret" "secure_storage_master_key" {
      - arn                            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt" -> null
      - name                           = "sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7" -> null
      - recovery_window_in_days        = 0 -> null
      - rotation_enabled               = false -> null
      - tags                           = {
          - "logical-id" = "PasswordSecret"
        } -> null
      - tags_all                       = {
          - "logical-id" = "PasswordSecret"
        } -> null
    }

  # module.complete.aws_secretsmanager_secret_version.config_backup_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "config_backup_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt|2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt" -> null
      - secret_string  = (sensitive value)
      - version_id     = "2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.console_password will be destroyed
  - resource "aws_secretsmanager_secret_version" "console_password" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv|67E3D23B-5EB3-459A-AFEA-68D46952CB43" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv" -> null
      - secret_string  = (sensitive value)
      - version_id     = "67E3D23B-5EB3-459A-AFEA-68D46952CB43" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_secretsmanager_secret_version.secure_storage_master_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "secure_storage_master_key" {
      - arn            = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt" -> null
      - id             = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt|69721694-D503-40E8-A738-8158C2BBCC75" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt" -> null
      - secret_string  = (sensitive value)
      - version_id     = "69721694-D503-40E8-A738-8158C2BBCC75" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.complete.aws_security_group.lan[0] will be destroyed
  - resource "aws_security_group" "lan" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0405b5473a0a97771" -> null
      - description            = "Security Group for private subnet. Allow everything by default" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0405b5473a0a97771" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - name                   = "Private Subnet" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "LAN"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_security_group.public[0] will be destroyed
  - resource "aws_security_group" "public" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0c83516c3117401be" -> null
      - description            = "Untrusted network restricted from access port 22 and 4444" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0c83516c3117401be" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 0 - 21"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 21
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 23 - 4443"
              - from_port        = 23
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 4443
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow public access 4445 - 65535"
              - from_port        = 4445
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Public" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Public"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_security_group.trusted[0] will be destroyed
  - resource "aws_security_group" "trusted" {
      - arn                    = "arn:aws:ec2:us-west-1:447552758530:security-group/sg-0fafda5febfc17189" -> null
      - description            = "Enable TCP access from trusted network" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow all traffic outbound"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0fafda5febfc17189" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "47.184.79.94/32",
                  - "20.245.175.52/32",
                ]
              - description      = "Allow all from trusted IP"
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "Trusted Network" -> null
      - owner_id               = "447552758530" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all               = {
          - "Name"          = "Trusted Network"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                 = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_subnet.private[0] will be destroyed
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-02a3a14ada345bdfa" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-02a3a14ada345bdfa" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "private-SOPHOS_CNF-f7-447552758530"
        } -> null
      - tags_all                                       = {
          - "Name" = "private-SOPHOS_CNF-f7-447552758530"
        } -> null
      - vpc_id                                         = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_subnet.public[0] will be destroyed
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-west-1:447552758530:subnet/subnet-01c62786f091a7c58" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-west-1b" -> null
      - availability_zone_id                           = "usw1-az3" -> null
      - cidr_block                                     = "10.0.0.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-01c62786f091a7c58" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = true -> null
      - owner_id                                       = "447552758530" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name"          = "public-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                                       = {
          - "Name"          = "public-SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - vpc_id                                         = "vpc-0db6232b295737a14" -> null
    }

  # module.complete.aws_vpc.this[0] will be destroyed
  - resource "aws_vpc" "this" {
      - arn                              = "arn:aws:ec2:us-west-1:447552758530:vpc/vpc-0db6232b295737a14" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-09f6014e9187f4c5b" -> null
      - default_route_table_id           = "rtb-04d736c3614464c8c" -> null
      - default_security_group_id        = "sg-0dc1e372fa656f455" -> null
      - dhcp_options_id                  = "dopt-001808c76c9383c0b" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = true -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0db6232b295737a14" -> null
      - instance_tenancy                 = "default" -> null
      - ipv6_netmask_length              = 0 -> null
      - main_route_table_id              = "rtb-04d736c3614464c8c" -> null
      - owner_id                         = "447552758530" -> null
      - tags                             = {
          - "Name"          = "SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
      - tags_all                         = {
          - "Name"          = "SOPHOS_CNF-f7-447552758530"
          - "contact_email" = "ralph.brynard@sophos.com"
          - "creation_date" = "09-30-2022"
          - "managed_by"    = "Terraform"
        } -> null
    }

  # module.complete.random_id.this will be destroyed
  - resource "random_id" "this" {
      - b64_std     = "SOPHOS_CNF-9w==" -> null
      - b64_url     = "SOPHOS_CNF-9w" -> null
      - byte_length = 1 -> null
      - dec         = "SOPHOS_CNF-247" -> null
      - hex         = "SOPHOS_CNF-f7" -> null
      - id          = "9w" -> null
      - prefix      = "SOPHOS_CNF-" -> null
    }

  # module.key-pair.aws_key_pair.this[0] will be destroyed
  - resource "aws_key_pair" "this" {
      - arn         = "arn:aws:ec2:us-west-1:447552758530:key-pair/sophos-example-complete3f" -> null
      - fingerprint = "fd:3e:a8:67:33:84:15:2b:d7:1f:72:de:6b:a6:25:d8" -> null
      - id          = "sophos-example-complete3f" -> null
      - key_name    = "sophos-example-complete3f" -> null
      - key_pair_id = "key-0a58177d68fc33249" -> null
      - key_type    = "rsa" -> null
      - public_key  = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD03BeeTXsi0Qoo35zZKguG6HaODXIVCdoSqOx0SPOl7eGUv5CVp32Nda5O8VeB/IYRSXFK78PA9njQBpAIyBu/qYdqsgE3bctK8xH46ZOw/McYLZcFyQtGRR/EsWR+HLu4m+jwGdxhmEmwzJvJ/ZjWh7k3Bu3fs3NaZqAJJhA1X3Sc/ObcHzcWDm2DSNp2UhlYkK6D3GSmP1ykGPeFxs1jKCZ0wHjE/CpORP68SI1HcrPkJy+SlVvKC79UrCkQixSxGIon59u3B0PgdCD71PVOtEzo7Efi+nYQ5KQuPB43uBMBLxfOs8XCyVIglBwl/Vl+BKfQhQpbAXstEIl+qq1g9+xgYTYot1umdo9poqxfCCnAlsyJSMna4Oga79JzzNYczH/mmV+i75E6Qa+5v2Pung8n5v2Lni8EgUKIvmmrBQcLR98roPDV8lMHf8GVtt9X3PreWzio28znqf9Cw2dlmeU3Ysx47CIEKUgzmayPPcW+cmnvxbFSMktGWDEOqAzav1dE42gYix7yv7AKNHfuIvt5ykBcC4y1JXz3++4LIGoQK47QXqbcoEpIbNjfkV0+giQ4yPKJ56O2+QEXkyg4QZpxFJigFJnINJPE7h6IcePlZAGvFmVlgi6awMRtVkUOiNwVyeSSnwGVzRaEbCxfG/hodXccUCvqMDfxXPuhgQ==" -> null
      - tags        = {} -> null
      - tags_all    = {} -> null
    }

  # module.key-pair.tls_private_key.this[0] will be destroyed
  - resource "tls_private_key" "this" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "515ce96f34f9c7a45fdec2cb74b073075a85e824" -> null
      - private_key_openssh           = (sensitive value)
      - private_key_pem               = (sensitive value)
      - private_key_pem_pkcs8         = (sensitive value)
      - public_key_fingerprint_md5    = "eb:f1:02:2a:ac:76:7a:64:75:fc:35:51:58:ee:49:3b" -> null
      - public_key_fingerprint_sha256 = "SHA256:pah4i/6g+w602eX+AslxW6LYMzeLdGUoe2Cg41rdlpo" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD03BeeTXsi0Qoo35zZKguG6HaODXIVCdoSqOx0SPOl7eGUv5CVp32Nda5O8VeB/IYRSXFK78PA9njQBpAIyBu/qYdqsgE3bctK8xH46ZOw/McYLZcFyQtGRR/EsWR+HLu4m+jwGdxhmEmwzJvJ/ZjWh7k3Bu3fs3NaZqAJJhA1X3Sc/ObcHzcWDm2DSNp2UhlYkK6D3GSmP1ykGPeFxs1jKCZ0wHjE/CpORP68SI1HcrPkJy+SlVvKC79UrCkQixSxGIon59u3B0PgdCD71PVOtEzo7Efi+nYQ5KQuPB43uBMBLxfOs8XCyVIglBwl/Vl+BKfQhQpbAXstEIl+qq1g9+xgYTYot1umdo9poqxfCCnAlsyJSMna4Oga79JzzNYczH/mmV+i75E6Qa+5v2Pung8n5v2Lni8EgUKIvmmrBQcLR98roPDV8lMHf8GVtt9X3PreWzio28znqf9Cw2dlmeU3Ysx47CIEKUgzmayPPcW+cmnvxbFSMktGWDEOqAzav1dE42gYix7yv7AKNHfuIvt5ykBcC4y1JXz3++4LIGoQK47QXqbcoEpIbNjfkV0+giQ4yPKJ56O2+QEXkyg4QZpxFJigFJnINJPE7h6IcePlZAGvFmVlgi6awMRtVkUOiNwVyeSSnwGVzRaEbCxfG/hodXccUCvqMDfxXPuhgQ==
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA9NwXnk17ItEKKN+c2SoL
            huh2jg1yFQnaEqjsdEjzpe3hlL+Qlad9jXWuTvFXgfyGEUlxSu/DwPZ40AaQCMgb
            v6mHarIBN23LSvMR+OmTsPzHGC2XBckLRkUfxLFkfhy7uJvo8BncYZhJsMybyf2Y
            1oe5Nwbt37NzWmagCSYQNV90nPzm3B83Fg5tg0jadlIZWJCug9xkpj9cpBj3hcbN
            YygmdMB4xPwqTkT+vEiNR3Kz5CcvkpVbygu/VKwpEIsUsRiKJ+fbtwdD4HQg+9T1
            TrRM6OxH4vp2EOSkLjweN7gTAS8XzrPFwslSIJQcJf1ZfgSn0IUKWwF7LRCJfqqt
            YPfsYGE2KLdbpnaPaaKsXwgpwJbMiUjJ2uDoGu/Sc8zWHMx/5plfou+ROkGvub9j
            7p4PJ+b9i54vBIFCiL5pqwUHC0ffK6Dw1fJTB3/BlbbfV9z63ls4qNvM56n/QsNn
            ZZnlN2LMeOwiBClIM5msjz3FvnJp78WxUjJLRlgxDqgM2r9XRONoGIse8r+wCjR3
            7iL7ecpAXAuMtSV89/vuCyBqECuO0F6m3KBKSGzY35FdPoIkOMjyieejtvkBF5Mo
            OEGacRSYoBSZyDSTxO4eiHHj5WQBrxZlZYIumsDEbVZFDojcFcnkkp8Blc0WhGws
            Xxv4aHV3HFAr6jA38Vz7oYECAwEAAQ==
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 4096 -> null
    }

Plan: 0 to add, 0 to change, 32 to destroy.

Changes to Outputs:
  - archive_name          = "7517866eb05f876f45c1f92f4725f6c55a51fdd7" -> null
  - availability_zone_map = {
      - us-west-1b = "usw1-az3"
      - us-west-1c = "usw1-az1"
    } -> null
  - private_key           = (sensitive value)
module.complete.aws_lambda_function.this: Destroying... [id=XG-Initial-Config-SOPHOS_CNF-f7]
module.complete.aws_secretsmanager_secret_version.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv|67E3D23B-5EB3-459A-AFEA-68D46952CB43]
module.complete.aws_route_table_association.private: Destroying... [id=rtbassoc-0fa73f03d88d76a91]
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt|2F7050A9-DDF6-47C5-81AE-B8C9F4DFDAA9]
module.complete.aws_eip.this[0]: Destroying... [id=eipalloc-05fa3e241aa846ac2]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt|69721694-D503-40E8-A738-8158C2BBCC75]
module.complete.aws_route_table_association.public: Destroying... [id=rtbassoc-07ac472f886fd21a4]
module.complete.aws_route.public: Destroying... [id=r-rtb-0804d4c6665d3ea521080289494]
module.complete.aws_route.private: Destroying... [id=r-rtb-0f51f5664c91fe53e1080289494]
module.complete.aws_instance.this: Destroying... [id=i-0c43ecc2e8630bddc]
module.complete.aws_secretsmanager_secret_version.secure_storage_master_key: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.console_password: Destruction complete after 0s
module.complete.aws_secretsmanager_secret_version.config_backup_password: Destruction complete after 0s
module.complete.aws_route_table_association.public: Destruction complete after 0s
module.complete.aws_lambda_function.this: Destruction complete after 0s
module.complete.aws_iam_role.lambda_execution_role: Destroying... [id=LambdaExecutionRole-SOPHOS_CNF-f7]
module.complete.aws_route_table_association.private: Destruction complete after 0s
module.complete.aws_route.public: Destruction complete after 0s
module.complete.aws_internet_gateway.this[0]: Destroying... [id=igw-09a7fe172ce55073e]
module.complete.aws_route_table.public[0]: Destroying... [id=rtb-0804d4c6665d3ea52]
module.complete.aws_route.private: Destruction complete after 1s
module.complete.aws_route_table.private[0]: Destroying... [id=rtb-0f51f5664c91fe53e]
module.complete.aws_iam_role.lambda_execution_role: Destruction complete after 1s
module.complete.aws_route_table.private[0]: Destruction complete after 0s
module.complete.aws_route_table.public[0]: Destruction complete after 1s
module.complete.aws_internet_gateway.this[0]: Destruction complete after 2s
module.complete.aws_eip.this[0]: Destruction complete after 2s
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 1m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 2m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m40s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 3m50s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 4m0s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 4m10s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 4m20s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 4m30s elapsed]
module.complete.aws_instance.this: Still destroying... [id=i-0c43ecc2e8630bddc, 4m40s elapsed]
module.complete.aws_instance.this: Destruction complete after 4m42s
module.complete.aws_iam_instance_profile.this: Destroying... [id=ec2-instance-profile-SOPHOS_CNF-f7]
module.complete.aws_launch_template.this: Destroying... [id=lt-0c2fdbf3d8e50b757]
module.complete.aws_launch_template.this: Destruction complete after 0s
module.key-pair.aws_key_pair.this[0]: Destroying... [id=sophos-example-complete3f]
module.complete.aws_network_interface.private: Destroying... [id=eni-0682ab1fc14b89c69]
module.complete.aws_network_interface.public: Destroying... [id=eni-050201b64ab436118]
module.complete.aws_iam_instance_profile.this: Destruction complete after 1s
module.complete.aws_iam_role.this: Destroying... [id=ec2-iam-role-SOPHOS_CNF-f7-447552758530]
module.key-pair.aws_key_pair.this[0]: Destruction complete after 1s
random_id.this: Destroying... [id=Pw]
random_id.this: Destruction complete after 0s
module.key-pair.tls_private_key.this[0]: Destroying... [id=515ce96f34f9c7a45fdec2cb74b073075a85e824]
module.key-pair.tls_private_key.this[0]: Destruction complete after 0s
module.complete.aws_network_interface.public: Destruction complete after 1s
module.complete.aws_security_group.public[0]: Destroying... [id=sg-0c83516c3117401be]
module.complete.aws_security_group.trusted[0]: Destroying... [id=sg-0fafda5febfc17189]
module.complete.aws_subnet.public[0]: Destroying... [id=subnet-01c62786f091a7c58]
module.complete.aws_network_interface.private: Destruction complete after 1s
module.complete.aws_security_group.lan[0]: Destroying... [id=sg-0405b5473a0a97771]
module.complete.aws_subnet.private[0]: Destroying... [id=subnet-02a3a14ada345bdfa]
module.complete.aws_iam_role.this: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.console_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-console-password-SOPHOS_CNF-f7-5OlNTv]
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-secure-storage-master-key-SOPHOS_CNF-f7-EObuyt]
module.complete.aws_secretsmanager_secret.config_backup_password: Destroying... [id=arn:aws:secretsmanager:us-west-1:447552758530:secret:sophos-fw-backup-configuration-password-SOPHOS_CNF-f7-BJ5cGt]
module.complete.aws_subnet.public[0]: Destruction complete after 0s
module.complete.aws_secretsmanager_secret.secure_storage_master_key: Destruction complete after 1s
module.complete.aws_secretsmanager_secret.config_backup_password: Destruction complete after 1s
module.complete.aws_secretsmanager_secret.console_password: Destruction complete after 1s
module.complete.aws_security_group.public[0]: Destruction complete after 1s
module.complete.aws_security_group.trusted[0]: Destruction complete after 1s
module.complete.aws_subnet.private[0]: Destruction complete after 1s
module.complete.aws_security_group.lan[0]: Destruction complete after 1s
module.complete.aws_vpc.this[0]: Destroying... [id=vpc-0db6232b295737a14]
module.complete.aws_vpc.this[0]: Destruction complete after 1s
module.complete.random_id.this: Destroying... [id=9w]
module.complete.random_id.this: Destruction complete after 0s
Releasing state lock. This may take a few moments...

Destroy complete! Resources: 32 destroyed.

```